# -*- coding: utf-8 -*-
'''
Story Config
============
'''

ASSET = {
        "PERSONS": (
            # (tag / name / full / age (birth) / job / call / info)
            ("hana", "花", "蜂須賀,花", 20,(1,1), "male", "大学生", "me:俺"),
            ("mizukawa", "水川", "", 20,(1,1), "female", "大学生", "me:わたし"),
            ("mitsu", "ミッツ", "", 11,(1,1), "female", "小学生", "me:わたし"),
            ("kitami", "喜多見", "", 24,(1,1), "male", "大学生", "me:オレ"),
            ),
        "STAGES": (
            # (tag / name / parent / (geometry) / info)
            ),
        "DAYS": (
            # (tag / name / month / day / year)
            ),
        "TIMES": (
            # (tag / name / hour / minute)
            ),
        "ITEMS": (
            # (tag / name / cate / info)
            ),
        "WORDS": (
            # (tag / name / cate / info)
            ),
        "RUBIS": (
            # (origin / rubi / exclusions / always)
            ("蜂須賀", "蜂須賀《はちすが》"),
            ("水川憂芽", "水川憂芽《みずかわゆめ》"),
            ("喜多見", "喜多見《きたみ》"),
            ("皺", "皺《しわ》"),
            ("喉", "喉《のど》"),
            ("顎", "顎《あご》"),
            ("残滓", "残滓《ざんし》"),
            ("隷属", "隷属《れいぞく》"),
            ("嚥下", "嚥下《えんげ》"),
            ("微睡([まみむめもん])", "微睡《まどろ》\\1"),
            ("掴([まみむめもん])", "掴《つか》\\1"),
            ("悦ぶ", "悦《よろこ》ぶ"),
            ("啜([らりるれろっ])", "啜《する》\\1"),
            ("顰め", "顰《しか》め"),
            ("囃([さしすせそ])", "囃《はや》\\1"),
            ("喚([かきくけこ])", "喚《わめ》\\1"),
            ("膨ら", "膨《ふく》ら"),
            ("剥([かきくけこい])", "剥《む》\\1"),
            ("剥([がぎぐげごい])", "剥《は》\\1"),
            ("頷([かきくけこい])", "頷《うなず》\\1"),
            ("覗([かきくけこい])", "覗《のぞ》\\1"),
            ("潤([まみむめもん])", "潤《うる》\\1"),
            ("跨([がぎぐげごい])", "跨《またが》\\1"),
            ("蘇([らりるれろっ])", "蘇《よみがえ》\\1"),
            ("噛([まみむめもん])", "噛《か》\\1"),
            ("癒([えや])", "癒《い》\\1"),
            ("這([あいうえおっ])", "這《は》\\1"),
            ),
        }

